export const JPN_TRANSLATION = {
  navbar: {
    menu: {
      trade: "取引",
      staking: "ステーキング",
      swap: "スワップ",
      bridge: "ブリッジ",
      supports: "サポート",
    },
  },
  landing: {
    cta: "分散型ブロックチェーンのためのオールインプラットフォーム",
    hero: {
      title: {
        one: "あなたのビットコインネイティブデフィジャーニーを高める",
        two: "RECTOVERSOと共に",
      },
      subtitle:
        "分散型取引、ステーキング、および簡略化されたブリッジングのためのオールインワンプラットフォーム。無限の可能性を解き放つ",
    },
    features: {
      title: {
        one: "強力で便利な機能へのアクセス。",
        two: "あなたの未来への道！直感的なプラットフォームで、資産をトレード、スワップ、ステーキング、ブリッジを手軽に行う",
      },
      card: {
        title: {
          one: "分散型取引",
          two: "ブリッジプラットフォーム",
          three: "スワップ取引",
          four: "ステーキングプラットフォーム",
        },
        desc: {
          one: "分散型取引の自由とセキュリティを体験してください。",
          two: "簡単に暗号資産をブリッジして、さまざまなブロックチェーンネットワークでの機会にアクセスし、投資の可能性を拡大します",
          three:
            "暗号通貨を手軽に安全にスワップして、ポートフォリオを多様化させます。",
          four: "資産をステーキングして収益を得ることで、ネットワークのセキュリティに貢献し、サポートに対する報酬を得ます",
        },
      },
    },
    info: {
      phaseOne: {
        title: {
          one: "スピードと戦略が交わる場所、高速DEX取引を提供します、",
          two: "利益を最大化するための簡単なスワップ！",
        },
        list: {
          one: "当社のDEXで高速取引に飛び込み、リミット注文や成行注文などさまざまな取引タイプを提供し、戦略的な操縦のために簡単に設定できる利益確定と損切りレベルを提供します。",
          two: "長期とショートの機能の力を利用して、市場のトレンドをナビゲートし、方向に関係なく利益を最大化します。",
          three:
            "当社のユーザーフレンドリーなインターフェースで暗号通貨を簡単に安全にスワップし、暗号通貨の交換を簡単かつストレスフリーにします。",
        },
      },
      phaseTwo: {
        title: {
          one: "ブリッジングの選択肢、利益を増やし、報酬を高める",
          two: "あなたの究極の暗号通貨の利点！",
        },
        list: {
          one: "さまざまな暗号資産間でシームレスにブリッジングし、ポートフォリオを管理する際の非常に選択肢と柔軟性を提供します。",
          two: "当社のステーキング機能を活用して利益を最大化し、ネットワークの検証に積極的に参加します。",
          three:
            "ステーキングプログラムを介して追加の暗号通貨報酬をオプションで受け取り、資産のポテンシャルを最大限に引き出します。",
        },
      },
    },
    provider: {
      title: {
        one: "あなたのウォレットを接続して、",
        two: "あなたを待っている独占的な利点を解除します",
      },
      desc: `エキサイティングなニュース！Resoを使用すると、さまざまな暗号ウォレットと接続できます。これにより、最適なものを選択できます`,
    },
    tags: {
      provide: "あなたに提供するもの",
      decentralize: "分散型取引とスワップ",
      methods: "ブリッジとステーキング",
      exchange: "分散型取引所",
    },
    connect: {
      title: {
        one: "実際に必要なものに接続する",
        two: "接続する",
      },
      desc: `今日、場所を確保して、Resoとの暗号通貨の旅を高めてください`,
    },
  },
  terms: {
    title: "Reso Exchange - 利用規約",
    subtitle: {
      one: `Reso Crypto Exchangeウェブサイトを使用する前に、これらの利用規約をよくお読みください`,
      link: "(https://reso.io/)",
      two: " Resoが運営する。",
    },
    body: {
      section: {
        one: {
          title: "1. 利用規約の受諾",
          desc: `Reso Crypto Exchangeウェブサイトおよびサービスにアクセスまたは使用することにより、これらの利用規約に同意したものとみなされます。すべての利用規約に同意しない場合は、当社のサービスを使用しないでください。`,
        },
        two: {
          title: "2. アカウント登録",
          subtitle: {
            one: {
              heading: "2.1. Reso Crypto Exchangeを使用するには",
              desc: `Reso Crypto Exchangeを使用するには、ユーザーは有効なメールアドレスを提供し、KYC（顧客の身元確認）プロセスを完了する必要があります。これには、国民身分証明書の提出が含まれる場合があります。`,
            },
            two: {
              heading: "2.2. ユーザーは機密性を維持する責任があります",
              desc: `ユーザーはアカウント情報の機密性を維持し、他の人とログイン資格情報を共有しないようにする責任があります。`,
            },
            three: {
              heading: "2.3. Resoはサービスを拒否する権利を留保します",
              desc: `Resoは、自己の裁量でサービスを拒否したり、アカウントを終了したり、コンテンツを削除または編集したりする権利を留保します`,
            },
          },
        },
        three: {
          title: "3. 取引とトランザクション",
          subtitle: {
            one: {
              heading: "3.1. Resoは中央集権型を提供します",
              desc: `Resoは、ユーザーが暗号通貨を取引できる中央集権型の暗号取引プラットフォームを提供します。`,
            },
            two: {
              heading:
                "3.2. ユーザーは預入金および引き出しを行うことができます",
              desc: `ユーザーは、プラットフォームでサポートされている通貨での暗号通貨の預金および引き出しを行うことができます。`,
            },
            three: {
              heading: "3.3. Reso Crypto Exchangeのすべての取引は",
              desc: `Reso Crypto Exchangeのすべての取引は、トランザクションプロセス中に明確に通知される適用可能な手数料の対象となります。`,
            },
          },
        },
        four: {
          title: "4. KYCおよび国民身分証明書",
          subtitle: {
            one: {
              heading: "4.1. ユーザーはKYCプロセスを経る必要があります",
              desc: `ユーザーは、規制要件を遵守し、プラットフォームのセキュリティを強化するために、KYCプロセスを経る必要があります。これには、国民身分証明書の提出が含まれる場合があります。`,
            },
            two: {
              heading: "4.2. KYC中に提供された国民身分証明書",
              desc: `KYC中に提供された国民身分証明書は、検証目的のみに安全に保存およびアクセスされ、適用可能な法的および規制基準に準拠しています。`,
            },
          },
        },
        five: {
          title: "5. プライバシーとデータセキュリティ",
          subtitle: {
            one: {
              heading:
                "5.1. Resoはユーザーのプライバシー保護に取り組んでいます",
              desc: `Resoはユーザーのプライバシーを保護することに取り組んでいます。個人情報および金融情報は、当社のプライバシーポリシーに従って処理されます。`,
            },
            two: {
              heading: "5.2. Resoはユーザーデータを共有しません",
              desc: `Resoは、ユーザーデータをマーケティング目的で第三者と共有しません。`,
            },
          },
        },
        six: {
          title: "6. 禁止された活動",
          subtitle: {
            one: {
              heading: `6.1. ユーザーは、違法または権限のない活動に関与しないことに同意する`,
              desc: `ユーザーは、Reso Crypto Exchangeで不正行為、マネーロンダリング、Resoシステムへの権限ないアクセスなどを含む違法または権限のない活動に関与しないことに同意します。`,
            },
            two: {
              heading: `6.2. Resoは調査し、適切な法的措置を講じる権利を留保します`,
              desc: `Resoは、禁止された活動に関与している者に対して適切な法的措置を調査し、講じる権利を留保します。`,
            },
          },
        },
        seven: {
          title: "7. サポート",
          desc: `Reso Crypto Exchangeに関連する問題に対する支援が必要な場合は、support@Reso.io までお問い合わせください。`,
        },
        eight: {
          title: "8. 利用規約の変更",
          desc: `Resoは、事前の通知なしにこれらの利用規約をいつでも更新または変更する権利を留保します。ユーザーは定期的に利用規約を確認することをお勧めします。Reso Crypto Exchangeを使用することで、最新版の利用規約に拘束されることに同意します。これらの利用規約は、[日付]に最後に更新されました。`,
        },
      },
    },
  },
  privacy: {
    title: "Rectoverso Exchange - プライバシーポリシー",
    body: {
      section: {
        one: {
          title: "1. 収集する情報",
          subtitle: {
            one: {
              heading: "1.1. アカウント情報：",
              desc: `Rectoversoに登録すると、名前、メールアドレス、および暗号化されたパスワードなどの情報が収集されます。KYC（顧客の身元確認）プロセス中に、国民身分証明書などの追加の詳細を提供する場合があります。`,
            },
            two: {
              heading: "1.2. トランザクションデータ",
              desc: `Rectoversoプラットフォーム上の暗号通貨の取引、預金、および引き出しに関連する情報が収集されます。これには、取引履歴、ウォレットアドレス、タイムスタンプが含まれます。`,
            },
            three: {
              heading: "1.3. コミュニケーション",
              desc: `サポートチームに連絡したり、メールでコミュニケーションを取ったりする場合、そのコミュニケーションの内容が収集および保存される場合があります。`,
            },
          },
        },
        two: {
          title: "2. 情報の利用方法",
          subtitle: {
            one: {
              heading: "2.1 アカウント管理",
              desc: `アカウント情報は、Rectoverso Crypto Exchangeアカウントの作成と管理、トランザクションの処理、およびアカウントのセキュリティを確保するために使用されます。`,
            },
            two: {
              heading: "2.2 KYC検証",
              desc: `KYCプロセス中に、国民身分証明書などの情報を収集および検証して、規制要件を満たし、プラットフォームのセキュリティを強化します。`,
            },
            three: {
              heading: "2.3. 取引",
              desc: `取引データは、必要に応じてリクエストされたように、暗号通貨の取引、預金、および引き出しを容易にします。`,
            },
            four: {
              heading: "2.4. コミュニケーション",
              desc: `連絡先情報を使用して重要な更新、通知、およびサービス関連のコミュニケーションを送信する場合があります。あなたのメールアドレスは、マーケティング目的で第三者と共有されることは決してありません。`,
            },
          },
        },
        three: {
          title: "3. データセキュリティ",
          subtitle: {
            one: {
              heading:
                "3.1. Rectoversoは高度なセキュリティ対策を採用しています",
              desc: `Rectoversoは、個人情報および金融情報を保護するために高度なセキュリティ対策を採用しています。これには、暗号化、セキュアソケットレイヤー（SSL）テクノロジー、定期的なセキュリティ監査が含まれます。`,
            },
            two: {
              heading: "3.2. KYC中に提供された国民身分証明書",
              desc: `KYC中に提供された国民身分証明書は、検証目的のみに安全に保存およびアクセスされ、適用可能な法的および規制基準に準拠しています。`,
            },
          },
        },
        four: {
          title: "4. 情報の共有",
          subtitle: {
            one: {
              heading: "4.1. Rectoversoは個人情報を販売または共有しません",
              desc: `Rectoversoは、マーケティング目的で個人情報を第三者と共有または販売しません。機能とプラットフォームのセキュリティを向上させるために、信頼できるパートナーやサービスプロバイダーと情報を共有する場合があります。`,
            },
            two: {
              heading: "4.2. あなたの情報を開示する場合があります",
              desc: `法的要求に応じて、ポリシーを執行するために、またはRectoverso、そのユーザー、その他の人々の権利、財産、または安全を保護するために、情報を開示する場合があります。`,
            },
          },
        },
        five: {
          title: "5. クッキーとアナリティクス",
          subtitle: {
            one: {
              heading:
                "5.1. Rectoversoはクッキーを使用してユーザーエクスペリエンスを向上させます",
              desc: `Rectoversoは、ユーザーエクスペリエンスを向上させ、分析目的のデータを収集するためにクッキーを使用します。クッキーはブラウザの設定で無効にすることができますが、ウェブサイトの一部の機能が正常に機能しない場合があります。`,
            },
          },
        },
        six: {
          title: "6. プライバシーポリシーの変更",
          desc: `Rectoversoは、このプライバシーポリシーをいつでも更新または変更する権利を留保します。ユーザーは定期的にポリシーを確認することが推奨されます。Rectoverso Crypto Exchangeの使用を継続することで、このプライバシーポリシーの最新版に同意したものとみなされます。このプライバシーポリシーは、[日付]に最後に更新されました。`,
        },
      },
    },
  },
  staking: {
    layout: {
      title: {
        one: "Rectoversoステーキング：最大限に",
        two: "あなたの収益を最大化します",
      },
      desc: `Rectoversoステーキングで収益を最大化し、Rectoversoステーキングエコシステムで利益を最大化するための専門的なヒントとトリックを見つけます`,
      info: {
        one: "総ロックバリュー（TVL）",
        two: "推定APY",
        three: "推定総報酬",
      },
    },
    card: {
      earn: "収益",
      stake: "ステーク",
      staked: "ステークされた",
      rewardCard: "報酬を獲得",
      apy: "APY",
      totalStaked: "総ステーク",
      end: "終了",
    },
    add: {
      card: {
        title: "新しいステーキングを追加",
        subtitle: "パブリックアクセス用の新しいステーキングプールを登録します",
        form: {
          one: {
            label: "トークンを選択",
            placeholder: "トークンステーキングを追加",
          },
          two: {
            placeholder: "金額を入力",
          },
          three: {
            label: "ユーザー参加を設定",
            placeholder: {
              one: "最小ユーザー",
              two: "最大ユーザー",
            },
          },
          four: {
            label: "ブロックごとの報酬",
          },
          five: {
            label: "期間ステーキング",
            placeholder: {
              one: "開始",
              two: "終了",
            },
          },
        },
        info: {
          list: {
            one: "ステーキングリスト料金を継続するには",
            two: `トークンはRectoverso Exchangeで登録されたことがありません。継続するには登録してください`,
          },
          reward: "支払う必要がある総報酬",
          estimatedAPY: "推定APY",
          estimatedTotalReward: "推定総報酬",
        },
      },
    },
    create: {
      available: "ステーク可能",
      totalStaked: "総ステーク",
      stakeCountDown: "ステーキングカウントダウン",
      stakeRewards: "ステーク報酬",
      yourStaked: "あなたのステーク",
      unclaimedRewards: "未請求の報酬",
    },
    modal: {
      unstake: {
        title: "資産のステーク解除",
      },
    },
  },
  button: {
    connectWallet: "ウォレットを接続",
    tryNow: "今すぐ試してみる",
    continue: "続ける",
    submit: "提出",
    unstake: "ステーク解除",
    claim: "請求",
  },
  tags: {
    language: "言語",
  },
  footer: {
    desc: "Resoへようこそ - 分散型ファイナンスの未来へのパスポートです！当社の直感的なプラットフォームを使用して、デジタル資産の世界をナビゲートするのが簡単になりました。経験豊富な投資家であろうと、初心者であろうと、Resoを使用することで、複雑さとはお別れし、無限の可能性に歓迎されます。今日すぐ参加して、新しい財務の自由の時代を解放してください！",
    title: {
      one: "について",
      two: "サポート",
    },
  },
  global: {
    noData: "データがありません",
    activate: "アクティベート",
    ended: "終了",
    myStaking: "私のステーキング",
    addStaking: "新しいステーキングを追加",
    requirement: "要件",
    max: "最大",
  },
};
