export const RU_TRANSLATION = {
  navbar: {
    menu: {
      trade: "Торговля",
      staking: "Стейкинг",
      swap: "Обмен",
      bridge: "Мост",
      supports: "Поддержка",
    },
  },
  landing: {
    cta: "Всё в одной платформе для децентрализованных блокчейнов",
    hero: {
      title: {
        one: "ПОВЫСЬТЕ УРОВЕНЬ СВОЕГО БИТКОИН-НАТИВНОГО ПУТЕШЕСТВИЯ В ОБЛАСТИ ДЕФИ",
        two: "С RECTOVERSO",
      },
      subtitle:
        "Все в одной платформе для децентрализованного обмена, стейкинга и оптимизированного моста, разблокируя безграничные возможности",
    },
    features: {
      title: {
        one: "Доступ к мощным и",
        two: "полезным функциям.",
      },
      subtitle:
        "Ваш путь в будущее децентрализованной финансовой системы! Торгуйте, обменивайте, стейкайте и мостите свои активы без усилий с помощью нашей интуитивной платформы",
      card: {
        title: {
          one: "Децентрализованный обмен",
          two: "Платформа моста",
          three: "Обмен токенов",
          four: "Платформа стейкинга",
        },
        desc: {
          one: "Почувствуйте свободу и безопасность децентрализованной торговли.",
          two: "Мостите свои криптовалютные активы легко, чтобы получить доступ к большему количеству возможностей на различных блокчейн-сетях, расширяя свои инвестиционные возможности",
          three:
            "Обменивайте свои криптовалюты без усилий и безопасно, диверсифицируя свой портфель с легкостью.",
          four: "Зарабатывайте пассивный доход и активно участвуйте в блокчейн-сетях, стейкая свои активы, способствуя безопасности сети и получая вознаграждение за вашу поддержку",
        },
      },
    },
    info: {
      phaseOne: {
        title: {
          one: "Где Скорость Встречается с Стратегией, Предлагая Быстрые Торги На DEX, ",
          two: "Простые Обмены для Улучшенных Преимуществ!",
        },
        list: {
          one: "Погрузитесь в молниеносные сделки на нашем DEX, предлагающем различные типы сделок, включая лимитные и рыночные ордера, наряду с легкими для установки уровнями прибыли и стоп-лосса для стратегического маневрирования.",
          two: "Воспользуйтесь мощью наших возможностей длинных и коротких позиций, позволяющих вам ориентироваться на рыночные тенденции и максимизировать свои доходы независимо от направления.",
          three:
            "Без труда обменивайте криптовалюты с нашим удобным интерфейсом, делая обмен криптовалютой легким и без стресса.",
        },
      },
      phaseTwo: {
        title: {
          one: "Выбор Мостов, Увеличение Доходов, Повышение Наград",
          two: "Ваша Последняя Крипто-Преимущество!",
        },
        list: {
          one: "Без проблем мостите между разнообразными криптовалютными активами, предоставляя вам беспрецедентный выбор и гибкость в управлении вашим портфелем.",
          two: "Увеличивайте свои доходы благодаря нашей функции стейкинга, позволяющей вам зарабатывать награды, активно участвуя в валидации сети",
          three:
            "Поднимите свои доходы на новый уровень с дополнительными криптовалютными наградами через нашу программу стейкинга, максимизируя потенциал ваших активов.",
        },
      },
    },
    provider: {
      title: {
        one: "Подключите ваш кошелек и Разблокируйте мир",
        two: "эксклюзивных преимуществ, ожидающих вас",
      },
      desc: `Захватывающие новости! Reso позволяет вам подключаться к различным криптокошелькам,
        гарантируя вам свободу выбора того, что лучше всего подходит вам`,
    },
    tags: {
      provide: "Что мы предлагаем вам",
      decentralize: "Децентрализованный обмен и обмен токенов",
      methods: "Мост и стейкинг",
      exchange: "Децентрализованная биржа",
    },
    connect: {
      title: {
        one: "Подключайтесь к тому, что вам",
        two: "действительно нужно",
      },
      desc: `Не упустите свой шанс - обеспечьте себе место сегодня и повысьте свой
        криптовалютный путь с Reso`,
    },
  },
  terms: {
    title: "Обмен Reso - Условия и положения",
    subtitle: {
      one: `Пожалуйста, внимательно прочтите эти условия и положения перед использованием
      веб-сайта Reso Crypto Exchange`,
      link: "(https://reso.io/)",
      two: ", работающего под управлением Reso.",
    },
    body: {
      section: {
        one: {
          title: "1. Принятие условий",
          desc: `Посещая или используя веб-сайт и
          услуги Reso Crypto Exchange, вы соглашаетесь быть связанным этими
          условиями и положениями. Если
          вы не согласны со всеми условиями и положениями, пожалуйста, не
          используйте наши услуги.`,
        },
        two: {
          title: "2. Регистрация учетной записи",
          subtitle: {
            one: {
              heading: "2.1. Для использования Reso Crypto Exchange",
              desc: `Для использования Reso Crypto Exchange пользователи должны
              зарегистрировать учетную запись, предоставив действующий адрес электронной почты и
              прошли процесс KYC (Познай своего клиента), который может включать
              предоставление национального
              удостоверения личности.`,
            },
            two: {
              heading: "2.2. Пользователи несут ответственность за сохранность",
              desc: `Пользователи несут ответственность за сохранность своей
              информации учетной записи и не должны делиться своими данными для входа
              с другими.`,
            },
            three: {
              heading:
                "2.3. Reso оставляет за собой право отказать в обслуживании",
              desc: `Reso оставляет за собой право отказать в обслуживании, закрыть учетные записи или
              удалить или отредактировать содержимое по своему усмотрению.`,
            },
          },
        },
        three: {
          title: "3. Торговля и операции",
          subtitle: {
            one: {
              heading: "3.1. Reso предоставляет централизованную",
              desc: `Reso предоставляет централизованную платформу для обмена криптовалют, где пользователи
              могут торговать криптовалютами.`,
            },
            two: {
              heading: "3.2. Пользователи могут вносить депозиты и выводить",
              desc: `Пользователи могут вносить депозиты и выводить криптовалюты, поддерживаемые
              платформа.`,
            },
            three: {
              heading: "3.3. Все операции на Reso Crypto Exchange",
              desc: `Все операции на Reso Crypto Exchange подлежат применимым
              сборам, которые будут четко обозначены во время операции.`,
            },
          },
        },
        four: {
          title: "4. KYC и национальные удостоверения личности",
          subtitle: {
            one: {
              heading: "4.1. Пользователи должны пройти процесс KYC",
              desc: `Пользователи должны пройти процесс KYC, который может включать
              предоставление национального удостоверения личности, чтобы соответствовать
              регулирующим требованиям и повысить безопасность платформы.`,
            },
            two: {
              heading:
                "4.2. Национальные удостоверения личности, предоставленные во время KYC",
              desc: `Национальные удостоверения личности, предоставленные во время KYC, хранятся в безопасности
              и доступны только для верификации, соответствуя
              применимым правовым и регулирующим стандартам.`,
            },
          },
        },
        five: {
          title: "5. Конфиденциальность и безопасность данных",
          subtitle: {
            one: {
              heading:
                "5.1. Reso обязуется защищать конфиденциальность пользователей",
              desc: `Reso обязуется защищать конфиденциальность пользователей. Личная и
              финансовая информация обрабатывается в соответствии с нашей политикой конфиденциальности.`,
            },
            two: {
              heading: "5.2. Reso никогда не делится данными пользователей",
              desc: `Reso никогда не передает данные пользователей третьим лицам в маркетинговых
              целях.`,
            },
          },
        },
        six: {
          title: "6. Запрещенные действия",
          subtitle: {
            one: {
              heading: `6.1. Пользователи соглашаются не заниматься незаконными или несанкционированными
              действиями`,
              desc: `Пользователи соглашаются не заниматься незаконными или несанкционированными
              действиями на Reso Crypto Exchange, включая, но не ограничиваясь
              мошенничеством, отмыванием денег и несанкционированным доступом к системам Reso.`,
            },
            two: {
              heading: `6.2. Reso оставляет за собой право на расследование`,
              desc: `Reso оставляет за собой право на расследование и принятие соответствующих правовых
              мер против лиц, занимающихся запрещенными действиями.`,
            },
          },
        },
        seven: {
          title: "7. Поддержка",
          desc: `Для получения помощи по любым вопросам, связанным с Reso Crypto
          Exchange, пользователи могут связаться с нашей службой поддержки по адресу support@Reso.io.`,
        },
        eight: {
          title: "8. Изменения в условиях и положениях",
          desc: `Reso оставляет за собой право обновлять или изменять эти Условия и
          положения в любое время без предварительного уведомления. Пользователи
          рекомендуется регулярно проверять условия. Используя Reso Crypto Exchange,
          вы соглашаетесь быть связанным наиболее актуальной версией этих Условий
          и положений. Эти Условия и положения были последний раз обновлены
          [Дата].`,
        },
      },
    },
  },
  privacy: {
    title: "Rectoverso Exchange - Политика конфиденциальности",
    body: {
      section: {
        one: {
          title: " 1. Информация, которую мы собираем",
          subtitle: {
            one: {
              heading: "1.1. Информация об учетной записи:",
              desc: `Когда вы регистрируетесь в Rectoverso, мы собираем информацию, такую как ваше имя, адрес электронной почты и зашифрованный пароль. Вы также можете предоставить дополнительные сведения во время процесса KYC (Знай своего клиента), включая национальный идентификационный документ.`,
            },
            two: {
              heading: "1.2. Данные транзакции",
              desc: `Мы собираем информацию, связанную с вашими криптоторгами, вкладами и выводами на платформе Rectoverso. Это включает в себя историю транзакций, адреса кошельков и временные метки.`,
            },
            three: {
              heading: " 1.3. Коммуникация",
              desc: `Когда вы обращаетесь в нашу службу поддержки или связываетесь с нами по электронной почте, мы можем собирать и хранить содержимое этих коммуникаций.`,
            },
          },
        },
        two: {
          title: " 2. Как мы используем вашу информацию",
          subtitle: {
            one: {
              heading: " 2.1 Управление учетной записью",
              desc: `Мы используем вашу информацию об учетной записи для создания и управления вашей учетной записью в криптобирже Rectoverso, обработки транзакций и обеспечения безопасности вашей учетной записи.`,
            },
            two: {
              heading: " 2.2 Проверка KYC",
              desc: `Во время процесса KYC мы собираем и проверяем ваш национальный идентификационный документ для соблюдения требований регулирования и повышения безопасности нашей платформы.`,
            },
            three: {
              heading: "  2.3. Транзакции",
              desc: `Ваши данные о транзакциях используются для проведения криптоторгов, вкладов и выводов по вашему запросу.`,
            },
            four: {
              heading: " 2.4. Коммуникация",
              desc: `Мы можем использовать ваши контактные данные для отправки важных обновлений, уведомлений и сервисных сообщений. Ваш адрес электронной почты никогда не будет передан третьим сторонам в рекламных целях.`,
            },
          },
        },
        three: {
          title: "3. Защита данных",
          subtitle: {
            one: {
              heading: "3.1. Rectoverso использует передовые меры безопасности",
              desc: `Rectoverso использует передовые меры безопасности для защиты вашей личной и финансовой информации. Это включает в себя шифрование, технологию защищенного сокета (SSL) и регулярные проверки безопасности.`,
            },
            two: {
              heading:
                " 3.2. Национальные идентификационные документы, предоставленные в ходе KYC",
              desc: `Национальные идентификационные документы, предоставленные в ходе KYC, хранятся безопасно и доступны только для целей верификации, соответствуя применимым правовым и регулирующим стандартам.`,
            },
          },
        },
        four: {
          title: "4. Предоставление информации",
          subtitle: {
            one: {
              heading:
                " 4.1. Rectoverso не продает и не передает вашу личную информацию",
              desc: `Rectoverso не продает и не передает вашу личную информацию третьим сторонам в рекламных целях. Мы можем передавать вашу информацию доверенным партнерам и поставщикам услуг для улучшения функциональности и безопасности нашей платформы.`,
            },
            two: {
              heading: " 4.2. Мы можем раскрывать вашу информацию",
              desc: `Мы можем раскрывать вашу информацию в ответ на юридические запросы, соблюдать наши политики или защищать права, собственность или безопасность Rectoverso, его пользователей или других лиц.`,
            },
          },
        },
        five: {
          title: " 5. Файлы cookie и аналитика",
          subtitle: {
            one: {
              heading:
                "5.1. Rectoverso использует файлы cookie для улучшения пользовательского опыта",
              desc: `Rectoverso использует файлы cookie для улучшения пользовательского опыта и сбора данных для аналитических целей. Файлы cookie можно отключить в настройках вашего браузера, но некоторые функции веб-сайта могут работать неправильно.`,
            },
          },
        },
        six: {
          title: " 6. Изменения в политике конфиденциальности",
          desc: `Rectoverso оставляет за собой право обновлять или изменять эту Политику конфиденциальности в любое время. Пользователей призывают регулярно проверять политику. Продолжая использовать криптобиржу Rectoverso, вы соглашаетесь с самой последней версией этой Политики конфиденциальности. По всем вопросам или проблемам, касающимся нашей Политики конфиденциальности, пожалуйста, свяжитесь с нами по адресу support@Rectoverso.io. Эта Политика конфиденциальности была последний раз обновлена [Дата].`,
        },
      },
    },
  },
  staking: {
    layout: {
      title: {
        one: "Rectoverso Стейкинг: Максимизируйте",
        two: "Ваши Заработки",
      },
      desc: `Максимизируйте свои заработки с помощью стейкинга Rectoverso и откройте для себя
        экспертные советы и хитрости, чтобы увеличить свою прибыль в экосистеме стейкинга Rectoverso`,
      info: {
        one: "Общая Заблокированная Сумма (TVL)",
        two: "Ожидаемый APY",
        three: "Ожидаемая Общая Награда",
      },
    },
    card: {
      earn: "Заработать",
      stake: "Застолбить",
      staked: "Застолблено",
      rewardCard: "Получить Награды",
      apy: "APY",
      totalStaked: "Всего Застолблено",
      end: "Конец",
    },
    add: {
      card: {
        title: "Добавить Новый Стейкинг",
        subtitle: "Зарегистрируйте новый стейкинг пул для общего доступа",
        form: {
          one: {
            label: "Выберите Токен",
            placeholder: "Добавьте токен для стейкинга",
          },
          two: {
            placeholder: "Введите сумму",
          },
          three: {
            label: "Установите Присоединение Пользователя",
            placeholder: {
              one: "Минимальный Пользователь",
              two: "Максимальный Пользователь",
            },
          },
          four: {
            label: "Награда За Блок",
          },
          five: {
            label: "Период Стейкинга",
            placeholder: {
              one: "Начало",
              two: "Окончание",
            },
          },
        },
        info: {
          list: {
            one: "Для продолжения стейкинга необходима комиссия за листинг",
            two: `Токен никогда не был зарегистрирован на бирже Rectoverso,
              пожалуйста, зарегистрируйтесь, чтобы продолжить`,
          },
          reward: "Общая Награда, Которую Необходимо Выплатить",
          estimatedAPY: "Ожидаемый APY",
          estimatedTotalReward: "Ожидаемая Общая Награда",
        },
      },
    },
    create: {
      available: "Доступно для Стейкинга",
      totalStaked: "Всего Застолблено",
      stakeCountDown: "Обратный Отсчет Стейкинга",
      stakeRewards: "Награды за Стейкинг",
      yourStaked: "Ваш Застолбленный",
      unclaimedRewards: "Невыплаченные Награды",
    },
    modal: {
      unstake: {
        title: "Снять Ставку",
      },
    },
  },
  button: {
    connectWallet: "Подключить кошелек",
    tryNow: "Попробуйте сейчас",
    continue: "Продолжить",
    submit: "Отправить",
    unstake: "Отозвать ставку",
    claim: "Претендовать",
  },
  tags: {
    language: "Язык",
  },
  footer: {
    desc: "Добро пожаловать в Reso - ваш паспорт в будущее децентрализованной финансовой сферы! Торгуйте, меняйте, ставьте и мостите ваши активы легко с нашей интуитивной платформой. Независимо от того, являетесь ли вы опытным инвестором или только начинаете, Reso делает навигацию в мире цифровых активов легкой и приятной. Попрощайтесь с сложностью и приветствуйте безграничные возможности. Присоединяйтесь к нам сегодня и откройте новую эру финансовой свободы!",
    title: {
      one: "О нас",
      two: "Поддержка",
    },
  },
  global: {
    noData: "Нет данных",
    activate: "Активировать",
    ended: "Завершено",
    myStaking: "Мои стейкинги",
    addStaking: "Добавить новый стейкинг",
    requirement: "Требование",
    max: "МАКС",
  },
};
